FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVT/IAR/flash_loader NOR/src/LPC1788_BSP.c
    wr_ptr = (uint32_t *)UEZBSP_SDRAM_BASE_ADDR;
    short_wr_ptr = (uint16_t *)wr_ptr;
    /* Clear content before 16 bit access test */
    //  for (i = 0; i < UEZBSP_SDRAM_SIZE/4; i++)
    //  {
    //  *wr_ptr++ = 0;
    //  }

    /* 16 bit write */
    for (i = 0; i < UEZBSP_SDRAM_SIZE / 0x40000; i++) {
        for (j = 0; j < 0x100; j++) {
            *short_wr_ptr++ = (i + j);
            *short_wr_ptr++ = (i + j) + 1;
        }
    }

    /* Verifying */
    wr_ptr = (uint32_t *)UEZBSP_SDRAM_BASE_ADDR;
    for (i = 0; i < UEZBSP_SDRAM_SIZE / 0x40000; i++) {
        for (j = 0; j < 0x100; j++) {
            data = *wr_ptr;
            if (data != (((((i + j) + 1) & 0xFFFF) << 16) | ((i + j) & 0xFFFF))) {
                return 0x0;
            }
            wr_ptr++;
        }
    }
    return 0x1;
}

/*****************************************************************************
 ** Function name:       find_cmddly
 **
 ** Descriptions:        find CMDDLY
 **
 ** parameters:          None
 **
 ** Returned value:      1 if test passed, otherwise 0
 **
 *****************************************************************************/
uint32_t find_cmddly(void)
{
    uint32_t cmddly, cmddlystart, cmddlyend, dwtemp;
    uint32_t ppass = 0x0, pass = 0x0;

    cmddly = 0x0;
    cmddlystart = cmddlyend = 0xFF;

    while (cmddly < 32) {
        dwtemp = LPC_SC->EMCDLYCTL & ~0x1F;
        LPC_SC->EMCDLYCTL = dwtemp | cmddly;

        if (sdram_test() == 0x1) {
            /* Test passed */
            if (cmddlystart == 0xFF) {
                cmddlystart = cmddly;
            }
            ppass = 0x1;
        } else {
            /* Test failed */
            if (ppass == 1) {
                cmddlyend = cmddly;
                pass = 0x1;
                ppass = 0x0;
            }
        }

        /* Try next value */
        cmddly++;
    }

    /* If the test passed, the we can use the average of the min and max values to get an optimal DQSIN delay */
    if (pass == 0x1) {
        cmddly = (cmddlystart + cmddlyend) / 2;
    } else if (ppass == 0x1) {
        cmddly = (cmddlystart + 0x1F) / 2;
    } else {
        /* A working value couldn't be found, just pick something safe so the system doesn't become unstable */
        cmddly = 0x10;
    }

    dwtemp = LPC_SC->EMCDLYCTL & ~0x1F;
    LPC_SC->EMCDLYCTL = dwtemp | cmddly;

    return (pass | ppass);
}

/*****************************************************************************
 ** Function name:       find_fbclkdly
 **
 ** Descriptions:        find FBCLKDLY
 **
 ** parameters:          None
 **
 ** Returned value:      1 if test passed, otherwise 0
 **
 *****************************************************************************/
uint32_t find_fbclkdly(void)
{
    uint32_t fbclkdly, fbclkdlystart, fbclkdlyend, dwtemp;
    uint32_t ppass = 0x0, pass = 0x0;

    fbclkdly = 0x0;
    fbclkdlystart = fbclkdlyend = 0xFF;

    while (fbclkdly < 32) {
        dwtemp = LPC_SC->EMCDLYCTL & ~0x1F00;
        LPC_SC->EMCDLYCTL = dwtemp | (fbclkdly << 8);

        if (sdram_test() == 0x1) {
            /* Test passed */
            if (fbclkdlystart == 0xFF) {
                fbclkdlystart = fbclkdly;
            }
            ppass = 0x1;
        } else {
            /* Test failed */
            if (ppass == 1) {
                fbclkdlyend = fbclkdly;
                pass = 0x1;
                ppass = 0x0;
            }
        }

        /* Try next value */
        fbclkdly++;
    }

    /* If the test passed, the we can use the average of the min and max values to get an optimal DQSIN delay */
    if (pass == 0x1) {
        fbclkdly = (fbclkdlystart + fbclkdlyend) / 2;
    } else if (ppass == 0x1) {
        fbclkdly = (fbclkdlystart + 0x1F) / 2;
    } else {
        /* A working value couldn't be found, just pick something safe so the system doesn't become unstable */
        fbclkdly = 0x10;
    }

    dwtemp = LPC_SC->EMCDLYCTL & ~0x1F00;
    LPC_SC->EMCDLYCTL = dwtemp | (fbclkdly << 8);

    return (pass | ppass);
}

/*****************************************************************************
 ** Function name:       calibration
 **
 ** Descriptions:        Calibration
 **
 ** parameters:          None
 **
 ** Returned value:      current ring osc count
 **
 *****************************************************************************/
uint32_t calibration(void)
{
    uint32_t dwtemp, i;
    uint32_t cnt = 0;

    for (i = 0; i < 10; i++) {
        dwtemp = LPC_SC->EMCCAL & ~0x4000;
        LPC_SC->EMCCAL = dwtemp | 0x4000;

        dwtemp = LPC_SC->EMCCAL;
        while ((dwtemp & 0x8000) == 0x0000) {
            dwtemp = LPC_SC->EMCCAL;
        }
        cnt += (dwtemp & 0xFF);
    }
    return (cnt / 10);
}

/*****************************************************************************
 ** Function name:       adjust_timing
 **
 ** Descriptions:        Adjust timing
 **
 ** parameters:          None
 **
 ** Returned value:      None
 **
 *****************************************************************************/
void adjust_timing(void)
{
    uint32_t dwtemp, cmddly, fbclkdly;

    /* Current value */
    ringosccount[1] = calibration();

    dwtemp = LPC_SC->EMCDLYCTL;
    cmddly = (((dwtemp & 0x1F) * ringosccount[0]) / ringosccount[1]) & 0x1F;
    fbclkdly = (((dwtemp & 0x1F00) * ringosccount[0]) / ringosccount[1])
            & 0x1F00;
    LPC_SC->EMCDLYCTL = (dwtemp & ~0x1F1F) | fbclkdly | cmddly;
}

/*---------------------------------------------------------------------------*
 * Routine:  UEZBSP_CPU_PinConfigInit
 *---------------------------------------------------------------------------*
 * Description:
 *      Immediately configure the port pins to their default settings
 *      to support hardware.
 *---------------------------------------------------------------------------*/
void LPC1788_BSP_PinConfigInit(void)
{
#include "LPC17xx_pin_macros.h"
#include "LPC1788_pinConfig.h"

    // P3 is data lines (0-31)
    // P4 is address lines (0-23)

    LPC_IOCON->P2_16 |= 1; // EMC_CASn
    LPC_IOCON->P2_17 |= 1; // EMC_RASn
    LPC_IOCON->P2_18 |= 1; // EMC_CLK_0
    LPC_IOCON->P2_20 |= 1; // EMC_DYCS0n
    LPC_IOCON->P2_24 |= 1; // EMC_CKE0
    LPC_IOCON->P2_28 |= 1; // EMC_DQM0
    LPC_IOCON->P2_29 |= 1; // EMC_DQM1
    LPC_IOCON->P2_30 |= 1; // EMC_DQM2
    LPC_IOCON->P2_31 |= 1; // EMC_DQM3
    LPC_IOCON->P3_0 |= 1; // EMC_D0
    LPC_IOCON->P3_1 |= 1; // EMC_D1
    LPC_IOCON->P3_2 |= 1; // EMC_D2
    LPC_IOCON->P3_3 |= 1; // EMC_D3
    LPC_IOCON->P3_4 |= 1; // EMC_D4
    LPC_IOCON->P3_5 |= 1; // EMC_D5
    LPC_IOCON->P3_6 |= 1; // EMC_D6
    LPC_IOCON->P3_7 |= 1; // EMC_D7
    LPC_IOCON->P3_8 |= 1; // EMC_D8
    LPC_IOCON->P3_9 |= 1; // EMC_D9
    LPC_IOCON->P3_10 |= 1; // EMC_D10
    LPC_IOCON->P3_11 |= 1; // EMC_D11
    LPC_IOCON->P3_12 |= 1; // EMC_D12
    LPC_IOCON->P3_13 |= 1; // EMC_D13
    LPC_IOCON->P3_14 |= 1; // EMC_D14
    LPC_IOCON->P3_15 |= 1; // EMC_D15
    LPC_IOCON->P3_16 |= 1; // EMC_D16
    LPC_IOCON->P3_17 |= 1; // EMC_D17
    LPC_IOCON->P3_18 |= 1; // EMC_D18
    LPC_IOCON->P3_19 |= 1; // EMC_D19
    LPC_IOCON->P3_20 |= 1; // EMC_D20
    LPC_IOCON->P3_21 |= 1; // EMC_D21
    LPC_IOCON->P3_22 |= 1; // EMC_D22
    LPC_IOCON->P3_23 |= 1; // EMC_D23
    LPC_IOCON->P3_24 |= 1; // EMC_D24
    LPC_IOCON->P3_25 |= 1; // EMC_D25
    LPC_IOCON->P3_26 |= 1; // EMC_D26
    LPC_IOCON->P3_27 |= 1; // EMC_D27
    LPC_IOCON->P3_28 |= 1; // EMC_D28
    LPC_IOCON->P3_29 |= 1; // EMC_D29
    LPC_IOCON->P3_30 |= 1; // EMC_D30
    LPC_IOCON->P3_31 |= 1; // EMC_D31
    LPC_IOCON->P4_0 |= 1; // EMC_A0
    LPC_IOCON->P4_1 |= 1; // EMC_A1
    LPC_IOCON->P4_2 |= 1; // EMC_A2
    LPC_IOCON->P4_3 |= 1; // EMC_A3
    LPC_IOCON->P4_4 |= 1; // EMC_A4
    LPC_IOCON->P4_5 |= 1; // EMC_A5
    LPC_IOCON->P4_6 |= 1; // EMC_A6
    LPC_IOCON->P4_7 |= 1; // EMC_A7
    LPC_IOCON->P4_8 |= 1; // EMC_A8
    LPC_IOCON->P4_9 |= 1; // EMC_A9
    LPC_IOCON->P4_10 |= 1; // EMC_A10
    LPC_IOCON->P4_11 |= 1; // EMC_A11
    LPC_IOCON->P4_12 |= 1; // EMC_A12
    LPC_IOCON->P4_13 |= 1; // EMC_A13
    LPC_IOCON->P4_14 |= 1; // EMC_A14
    LPC_IOCON->P4_15 |= 1; // EMC_A15
    LPC_IOCON->P4_16 |= 1; // EMC_A16
    LPC_IOCON->P4_17 |= 1; // EMC_A17
    LPC_IOCON->P4_18 |= 1; // EMC_A18
    LPC_IOCON->P4_19 |= 1; // EMC_A19
    LPC_IOCON->P4_20 |= 1; // EMC_A20
    LPC_IOCON->P4_21 |= 1; // EMC_A21
    LPC_IOCON->P4_22 |= 1; // EMC_A22
    LPC_IOCON->P4_23 |= 1; // EMC_A23
    LPC_IOCON->P4_24 |= 1; // EMC_OEn
    LPC_IOCON->P4_25 |= 1; // EMC_WEn
    LPC_IOCON->P4_30 |= 1; // EMC_CS0n

