FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVT/IAR/flash_loader NOR/src/LPC1788_BSP.c
#if 0
    // Any pins that need to be set high, set them now
    LPC_GPIO0->SET = PINCFG_PINSET(P0);
    LPC_GPIO1->SET = PINCFG_PINSET(P1);
    LPC_GPIO2->SET = PINCFG_PINSET(P2);
    LPC_GPIO3->SET = PINCFG_PINSET(P3);
    LPC_GPIO4->SET = PINCFG_PINSET(P4);
    LPC_GPIO5->SET = PINCFG_PINSET(P5);

    // Any pins that need to be set low, set them now
    LPC_GPIO0->CLR = PINCFG_PINCLR(P0);
    LPC_GPIO1->CLR = PINCFG_PINCLR(P1);
    LPC_GPIO2->CLR = PINCFG_PINCLR(P2);
    LPC_GPIO3->CLR = PINCFG_PINCLR(P3);
    LPC_GPIO4->CLR = PINCFG_PINCLR(P4);
    LPC_GPIO5->CLR = PINCFG_PINCLR(P5);

    // Set the pin direction (input/output)
    // For most cases, none of the above drives until this point
    LPC_GPIO0->DIR = PINCFG_PINDIR(P0);
    LPC_GPIO1->DIR = PINCFG_PINDIR(P1);
    LPC_GPIO2->DIR = PINCFG_PINDIR(P2);
    LPC_GPIO3->DIR = PINCFG_PINDIR(P3);
    LPC_GPIO4->DIR = PINCFG_PINDIR(P4);
    LPC_GPIO5->DIR = PINCFG_PINDIR(P5);
#endif
}

void LPC1788_BSP_PLLConfigure(void)
{
    int i;
    TUInt32 pll0stat;
    TUInt32 cclksel;

    // Artificial delay for testing
    for (i = 0; i < 100000; i++)
        ;

#if (FLASH_SETUP == 1)                  /* Flash Accelerator Setup            */
    LPC_SC->FLASHCFG = FLASHCFG_Val;
#endif
#if (CLOCK_SETUP)                       /* Clock Setup                        */
    LPC_SC->SCS = SCS_Val;
    if (SCS_Val & (1 << 5)) { /* If Main Oscillator is enabled      */
        while ((LPC_SC->SCS & (1 << 6)) == 0)
            ;/* Wait for Oscillator to be ready    */
    }

    LPC_SC->PCLKSEL = PCLKSEL_Val; /* Peripheral Clock Selection         */

    LPC_SC->EMCCLKSEL = EMCCLKSEL_Val; /* EMC Clock Selection                */

    LPC_SC->SPIFISEL = SPIFISEL_Val; /* SPIFI Clock Selection              */
    LPC_SC->CLKSRCSEL = CLKSRCSEL_Val; /* Select Clock Source for PLL0       */
    LPC_SC->CCLKSEL = CCLKSEL_Val; /* Setup Clock Divider                */
#if (PLL0_SETUP)
    LPC_SC->PLL0CFG = PLL0CFG_Val;
    LPC_SC->PLL0CON = 0x01; /* PLL0 Enable                        */
    LPC_SC->PLL0FEED = 0xAA;
    LPC_SC->PLL0FEED = 0x55;
    while (!(LPC_SC->PLL0STAT & (1 << 10)))
        ;/* Wait for PLOCK0                    */

    LPC_SC->PLL0CON = 0x03; /* PLL0 Enable & Connect              */
    LPC_SC->PLL0FEED = 0xAA;
    LPC_SC->PLL0FEED = 0x55;

    LPC_SC->CCLKSEL |= 0x100;
    LPC_SC->SPIFISEL = 0x100 | SPIFISEL_Val; /* It seems that the LPC_SC->SPIFISEL is W only */
#endif

#if (PLL1_SETUP)
    LPC_SC->USBCLKSEL = USBSEL_Val; /* Setup USB Clock Divider            */

    LPC_SC->PLL1CFG = PLL1CFG_Val;
    LPC_SC->PLL1CON = 0x01; /* PLL1 Enable                        */
    LPC_SC->PLL1FEED = 0xAA;
    LPC_SC->PLL1FEED = 0x55;
    while (!(LPC_SC->PLL1STAT & (1 << 10)))
        ;/* Wait for PLOCK1                    */

    LPC_SC->PLL1CON = 0x03; /* PLL1 Enable & Connect              */
    LPC_SC->PLL1FEED = 0xAA;
    LPC_SC->PLL1FEED = 0x55;

    LPC_SC->USBCLKSEL |= 0x200;
    //  LPC_SC->SPIFISEL = 0x200 | SPIFISEL_Val; /* It seems that the LPC_SC->SPIFISEL is W only */
#else
    LPC_SC->USBSEL = USBSEL_Val; /* Setup USB Clock Divider            */
#endif

    LPC_SC->PCONP = PCONP_Val; /* Power Control for Peripherals      */

    LPC_SC->CLKOUTCFG = CLKOUTCFG_Val; /* Clock Output Configuration         */
#endif

    /* Determine clock frequency according to clock register values             */
    if (((LPC_SC->PLL0STAT >> 8) & 3) == 3) {/* If PLL0 enabled and connected      */
        pll0stat = (LPC_SC->PLL0STAT & 0x1F) + 1;
        cclksel = LPC_SC->CCLKSEL & 0x1F;
        switch (LPC_SC->CLKSRCSEL & 0x03) {
            case 0: /* Internal RC oscillator => PLL0     */
                SystemFrequency = ((IRC_OSC * pll0stat) / cclksel);
                PeripheralFrequency = (IRC_OSC * pll0stat / cclksel);
                break;
            case 1: /* Main oscillator => PLL0            */
                SystemFrequency = ((OSC_CLK * pll0stat) / cclksel);
                PeripheralFrequency = (OSC_CLK * pll0stat / cclksel);
                break;
        }
    } else {
        switch (LPC_SC->CLKSRCSEL & 0x03) {
            case 0: /* Internal RC oscillator => PLL0     */
                SystemFrequency = IRC_OSC / (LPC_SC->CCLKSEL & 0x1F);
                break;
            case 1: /* Main oscillator => PLL0            */
                SystemFrequency = OSC_CLK / (LPC_SC->CCLKSEL & 0x1F);
                break;
        }
    }
}

void LPC1788_BSP_InitializeNORFlash(void)
{
    // --- M29W128G NOR Flash ---
#if 1 // Faster configuration
    // Configuration the NOR Flash like a static memory
    LPC_EMC->StaticConfig0 = (1 << 0) | // 1=16-bit
            (0 << 3) | // 0=page mode disabled (TBD: for now)
            (0 << 6) | // 0=Acive LOW chip select (CS0n -> En)
            (1 << 7) | // 0=For Reads BLSn[3:0] HIGH, For writes BLSn[3:0] LOW (not used)
            (0 << 8) | // 0=Extended Wait disabled (POR reset value)
            (0 << 19) | // 0=Buffer disabled (POR reset value, TBD)
            (0 << 20); // 0=Write not protected

    // Delay from chip select or address change, whichever is later to
    // the output enable
    // Use tAVQV = tACC = Address valid to Output Valid
    LPC_EMC->StaticWaitOen0 = 0; // FLASH_CYCLES(5)-0; //was 45

    // Delay from the chip select to the read access
    // Use tELQV = tEn = Address valid to Next Address Valid
    LPC_EMC->StaticWaitRd0 = FLASH_CYCLES(90) - 1; // 90 ns

    // Page Mode Read Delay register
    // Delay for asynchronous page mode sequential access
    // use tRC = address valid to address valid
    LPC_EMC->StaticWaitPage0 = 0; // FLASH_CYCLES(90)-1; // 90 ns

    // Delay from Chip select to write enable time
    // Use tELWL = tCS = Chip Enable Low to Write Enable Low
    LPC_EMC->StaticWaitWen0 = 0; // FLASH_CYCLES(45)-1;

    // Write Delay Register
    // Delay from the Chip Select to the Write Access
    // use tWLRH = tWP = Write Enable Low to Write Enable High
    LPC_EMC->StaticWaitWr0 = FLASH_CYCLES(90) - 2; // was 90 ns

