FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVT/IAR/flash_loader NOR/src/LPC1788_BSP.c
    // Turn Round Delay register
    // Number of bus turnaround cycles, cycles between read and write access
    // use tWLRH = tWP = Write Enable Low to Write Enable High
    LPC_EMC->StaticWaitTurn0 = 1; // FLASH_CYCLES(45)-1;
#else
    // SLOW NOR FLASH!  WILL CAUSE LCD TO FLICKER!  TESTING ONLY

    // Configuration the NOR Flash like a static memory
    LPC_EMC->StaticConfig0 =
    (1<<0)| // 1=16-bit
    (0<<3)| // 0=page mode disabled (TBD: for now)
    (0<<6)| // 0=Acive LOW chip select (CS0n -> En)
    (1<<7)| // 0=For Reads BLSn[3:0] HIGH, FOr writes BLSn[3:0] LOW (not used)
    // NOTE!  This MUST be a 1 to get a pronounced WEn even though
    // a target may not use the BLSn[0:3] lines at all!
    (0<<8)| // 0=Extended Wait disabled (POR reset value)
    (0<<19)| // 0=Buffer disabled (POR reset value, TBD)
    (0<<20); // 0=Write not protected

    // Delay from Chip select to write enable time
    // Use tELWL = tCS = Chip Enable Low to Write Enable Low
    LPC_EMC->StaticWaitWen0 = 0x0F;

    // Delay from chip select or address change, whichever is later to
    // the output enable
    // Use tAVQV = tACC = Address valid to Output Valid
    LPC_EMC->StaticWaitOen0 = 0x0F;

    // Delay from the chip select to the read access
    // Use tELQV = tEn = Address valid to Next Address Valid
    LPC_EMC->StaticWaitRd0 = 0x1F;

    // Page Mode Read Delay register
    // Delay for asynchronous page mode sequential access
    LPC_EMC->StaticWaitPage0 = 0x0F;

    // Write Delay Register
    // Delay from the Chip Select to the Write Access
    LPC_EMC->StaticWaitWr0 = 0x1F;

    // Turn Round Delay register
    // Number of bus turnaround cycles, cycles between read and write access
    LPC_EMC->StaticWaitTurn0 = 0x0F;
#endif

    // Make sure address are byte wise on the address bus
    LPC_SC->SCS |= (1 << 0);

    // Which of type of NOR flash do we have installed?
    // Read CFI information and verify we can get QRY in the query area
    FLASH0[0x55] = 0x0098;
    if ((FLASH0[0x10] == 'Q') && (FLASH0[0x11] == 'R') && (FLASH0[0x12] == 'Y')) {
        // Valid header, now read the settings.
        G_BSPNORFlashSize = 1 << FLASH0[0x27];
        G_BSPNORFlashBitWidth = FLASH0[0x28];
    } else {
        // Use unknown values
        G_BSPNORFlashSize = 0;
        G_BSPNORFlashBitWidth = 0;
    }

    // Take NOR flash out of this mode (reset)
    // Reset the NOR flash to take us out of this mode
    FLASH0[0x555] = 0x00AA;
    FLASH0[0x2AA] = 0x0055;
    FLASH0[0x0] = 0x00F0;
}

void LPC1788_BSP_SDRAMInit(void)
{
    volatile unsigned int i, dummy = dummy;
    // EMC Reset Disable = Enabled, Both EMC resets are asserted
    // when any type of reset occurs.
    // [Ref: LPC178x_7x_UM_0.01 page 30, Table 14]
    LPC_SC->SCS &= ~(1 << 1);

    // Turn on EMC PCLK (if not already on)
    // [Ref: LPC178x_7x_UM_0.01 page 58, Table 36]
    LPC_SC->PCONP |= (1 << 11);

    // Setup slow/default delays
    LPC_SC->EMCDLYCTL = 0x00001010;

    // Reset the EMC and put configuration
    // back to power up reset (little-endian mode, 1:1 clock)
    // [Ref: LPC178x_7x_UM_0.01 page 156]
    LPC_EMC->Control = 0x00000001;
    LPC_EMC->Config = 0x00000000;

#if 0
    // Configure for 32-bit data bus
    // Each pin is set to alternative function 1
    LPC_IOCON->P3_0 |= 1; /* D0 @ P3.0 */
    LPC_IOCON->P3_1 |= 1; /* D1 @ P3.1 */
    LPC_IOCON->P3_2 |= 1; /* D2 @ P3.2 */
    LPC_IOCON->P3_3 |= 1; /* D3 @ P3.3 */

    LPC_IOCON->P3_4 |= 1; /* D4 @ P3.4 */
    LPC_IOCON->P3_5 |= 1; /* D5 @ P3.5 */
    LPC_IOCON->P3_6 |= 1; /* D6 @ P3.6 */
    LPC_IOCON->P3_7 |= 1; /* D7 @ P3.7 */

    LPC_IOCON->P3_8 |= 1; /* D8 @ P3.8 */
    LPC_IOCON->P3_9 |= 1; /* D9 @ P3.9 */
    LPC_IOCON->P3_10 |= 1; /* D10 @ P3.10 */
    LPC_IOCON->P3_11 |= 1; /* D11 @ P3.11 */

    LPC_IOCON->P3_12 |= 1; /* D12 @ P3.12 */
    LPC_IOCON->P3_13 |= 1; /* D13 @ P3.13 */
    LPC_IOCON->P3_14 |= 1; /* D14 @ P3.14 */
    LPC_IOCON->P3_15 |= 1; /* D15 @ P3.15 */

    LPC_IOCON->P3_16 |= 1; /* D16 @ P3.16 */
    LPC_IOCON->P3_17 |= 1; /* D17 @ P3.17 */
    LPC_IOCON->P3_18 |= 1; /* D18 @ P3.18 */
    LPC_IOCON->P3_19 |= 1; /* D19 @ P3.19 */

    LPC_IOCON->P3_20 |= 1; /* D20 @ P3.20 */
    LPC_IOCON->P3_21 |= 1; /* D21 @ P3.21 */
    LPC_IOCON->P3_22 |= 1; /* D22 @ P3.22 */
    LPC_IOCON->P3_23 |= 1; /* D23 @ P3.23 */

    LPC_IOCON->P3_24 |= 1; /* D24 @ P3.24 */
    LPC_IOCON->P3_25 |= 1; /* D25 @ P3.25 */
    LPC_IOCON->P3_26 |= 1; /* D26 @ P3.26 */
    LPC_IOCON->P3_27 |= 1; /* D27 @ P3.27 */

    LPC_IOCON->P3_28 |= 1; /* D28 @ P3.28 */
    LPC_IOCON->P3_29 |= 1; /* D29 @ P3.29 */
    LPC_IOCON->P3_30 |= 1; /* D30 @ P3.30 */
    LPC_IOCON->P3_31 |= 1; /* D31 @ P3.31 */

    // Configure for 32-bit address lines A0 to A19
    // Each pin is set to alternative function 1
    LPC_IOCON->P4_0 |= 1; /* A0 @ P4.0 */
    LPC_IOCON->P4_1 |= 1; /* A1 @ P4.1 */
    LPC_IOCON->P4_2 |= 1; /* A2 @ P4.2 */
    LPC_IOCON->P4_3 |= 1; /* A3 @ P4.3 */

    LPC_IOCON->P4_4 |= 1; /* A4 @ P4.4 */
    LPC_IOCON->P4_5 |= 1; /* A5 @ P4.5 */
    LPC_IOCON->P4_6 |= 1; /* A6 @ P4.6 */
    LPC_IOCON->P4_7 |= 1; /* A7 @ P4.7 */

    LPC_IOCON->P4_8 |= 1; /* A8 @ P4.8 */
    LPC_IOCON->P4_9 |= 1; /* A9 @ P4.9 */
    LPC_IOCON->P4_10 |= 1; /* A10 @ P4.10 */
    LPC_IOCON->P4_11 |= 1; /* A11 @ P4.11 */

    LPC_IOCON->P4_12 |= 1; /* A12 @ P4.12 */
    LPC_IOCON->P4_13 |= 1; /* A13 @ P4.13 */
    LPC_IOCON->P4_14 |= 1; /* A14 @ P4.14 */
    LPC_IOCON->P4_15 |= 1; /* A15 @ P4.15 */

    LPC_IOCON->P4_16 |= 1; /* A16 @ P4.16 */
    LPC_IOCON->P4_17 |= 1; /* A17 @ P4.17 */
    LPC_IOCON->P4_18 |= 1; /* A18 @ P4.18 */
    LPC_IOCON->P4_19 |= 1; /* A19 @ P4.19 */

    //      LPC_IOCON->P4_20 |= 1; /* A20 @ P4.20 */
    //      LPC_IOCON->P4_21 |= 1; /* A21 @ P4.21 */
    //      LPC_IOCON->P4_22 |= 1; /* A22 @ P4.22 */
    //      LPC_IOCON->P4_23 |= 1; /* A23 @ P4.23 */

    // Configure control pins (we really only care for bus lane 0)
    LPC_IOCON->P4_24 |= 1; /* OEN @ P4.24 */
    LPC_IOCON->P4_25 |= 1; /* WEN @ P4.25 */
    //      LPC_IOCON->P4_26 |= 1; /* BLSN[0] @ P4.26 */
    //      LPC_IOCON->P4_27 |= 1; /* BLSN[1] @ P4.27 */

    //      LPC_IOCON->P4_28 |= 1; /* BLSN[2] @ P4.28 */
    //      LPC_IOCON->P4_29 |= 1; /* BLSN[3] @ P4.29 */
    LPC_IOCON->P4_30 |= 1; /* CSN[0] @ P4.30 */
    //      LPC_IOCON->P4_31 |= 1; /* CSN[1] @ P4.31 */

