FutureDesigns/uEZ/uEZ/Source/Platform/FDI/uEZGUI_1788_70WVT/IAR/flash_loader NOR/src/LPC1788_BSP.c
    //      LPC_IOCON->P2_14 |= 1; /* CSN[2] @ P2.14 */
    //      LPC_IOCON->P2_15 |= 1; /* CSN[3] @ P2.15 */

    LPC_IOCON->P2_16 |= 1; /* CASN @ P2.16 */
    LPC_IOCON->P2_17 |= 1; /* RASN @ P2.17 */
    LPC_IOCON->P2_18 |= 1; /* CLK[0] @ P2.18 */
    //      LPC_IOCON->P2_19 |= 1; /* CLK[1] @ P2.19 */

    LPC_IOCON->P2_20 |= 1; /* DYCSN[0] @ P2.20 */
    //      LPC_IOCON->P2_21 |= 1; /* DYCSN[1] @ P2.21 */
    //      LPC_IOCON->P2_22 |= 1; /* DYCSN[2] @ P2.22 */
    //      LPC_IOCON->P2_23 |= 1; /* DYCSN[3] @ P2.23 */

    LPC_IOCON->P2_24 |= 1; /* CKE[0] @ P2.24 */
    //      LPC_IOCON->P2_25 |= 1; /* CKE[1] @ P2.25 */
    //      LPC_IOCON->P2_26 |= 1; /* CKE[2] @ P2.26 */
    //      LPC_IOCON->P2_27 |= 1; /* CKE[3] @ P2.27 */

    LPC_IOCON->P2_28 |= 1; /* DQM[0] @ P2.28 */
    LPC_IOCON->P2_29 |= 1; /* DQM[1] @ P2.29 */
    LPC_IOCON->P2_30 |= 1; /* DQM[2] @ P2.30 */
    LPC_IOCON->P2_31 |= 1; /* DQM[3] @ P2.31 */
#endif

#if (UEZBSP_SDRAM_SIZE==(8*1024*1024))
    LPC_EMC->DynamicConfig0 = 0x00005300;
#elif (UEZBSP_SDRAM_SIZE==(16*1024*1024))
    LPC_EMC->DynamicConfig0 = 0x00005500;
#elif (UEZBSP_SDRAM_SIZE==(32*1024*1024))
    LPC_EMC->DynamicConfig0 = 0x00005480;
#else
#error "Unsupported UEZBSP_SDRAM_SIZE!"
#endif

    // RAS=2, CAS=2
    LPC_EMC->DynamicRasCas0 = 0x00000202;
    LPC_EMC->DynamicReadConfig = 0x00000001; /* Command delayed strategy, using EMCCLKDELAY */

    // -6 timings
    LPC_EMC->DynamicRP = SDRAM_CYCLES(20); // (1) tRP min = 20 ns
    LPC_EMC->DynamicRAS = SDRAM_CYCLES(42); // (2) tRAS min = 42 ns
    LPC_EMC->DynamicSREX = SDRAM_CYCLES(70); // (4) use tXSR min = 70 ns
    LPC_EMC->DynamicAPR = SDRAM_CYCLES(18); // (1) no tAPR, using tRCD = 18 ns
    LPC_EMC->DynamicDAL = SDRAM_CLOCKS(4); // (3) for CL 2, tDAL = 4 tCK
    LPC_EMC->DynamicWR = (SDRAM_CYCLES(6) + SDRAM_CLOCKS(1)); // (1) tWR = tCK + 6ns
    LPC_EMC->DynamicRC = SDRAM_CYCLES(60); // (4) tRC min = 60 ns
    LPC_EMC->DynamicRFC = SDRAM_CYCLES(60); // (4) tRFC min = 60 ns
    LPC_EMC->DynamicXSR = SDRAM_CYCLES(70); // (4) tXSR min = 70 ns
    LPC_EMC->DynamicRRD = SDRAM_CYCLES(12); // (0) tRRD = 12 ns
    LPC_EMC->DynamicMRD = SDRAM_CLOCKS(2); // (1) tMRD = 2 tCK

    //Send command: NOP
    LPC_EMC->DynamicControl = 0x00000183;

    //wait 200mS
    UEZBSPDelayMS(200);

    //Send command: PRECHARGE-ALL, shortest possible refresh period
    LPC_EMC->DynamicControl = 0x00000100;
    LPC_EMC->DynamicRefresh = 0x00000001;

    //wait at least 128 ABH clock cycles
    for (i = 0; i < 0x100; i++)
        NOP();

    //Set correct refresh period
#define SDRAM_REFRESH_PERIOD    64 // ms
#define SDRAM_REFRESH_CYCLES    8192
    LPC_EMC->DynamicRefresh = (unsigned int)((((SDRAM_CLOCK_FREQUENCY / 1000)
            * SDRAM_REFRESH_PERIOD) / SDRAM_REFRESH_CYCLES) / 16) + 1;

    //wait at least 128 ABH clock cycles
    for (i = 0; i < 0x40; i++)
        NOP();

    //Send command: MODE
    LPC_EMC->DynamicControl = 0x00000080;

    //Set mode register in SDRAM
#if (UEZBSP_SDRAM_SIZE==(32*1024*1024))
    dummy = *((volatile unsigned int*)(UEZBSP_SDRAM_BASE_ADDR | (0x22 << 11)));
#else
    dummy = *((volatile unsigned int*)(UEZBSP_SDRAM_BASE_ADDR | (0x22 << 10)));
#endif
    //wait 128 ABH clock cycles
    for (i = 0; i < 0x40; i++)
        NOP();

    //Send command: NORMAL
    LPC_EMC->DynamicControl = 0x00000000;

    //Enable buffer
    LPC_EMC->DynamicConfig0 |= 0x00080000;

    //initial system delay
    UEZBSPDelayMS(1);

    ringosccount[0] = calibration();

    if (find_cmddly() == 0x0) {
        while (1)
            ; /* fatal error */
    }

    if (find_fbclkdly() == 0x0) {
        while (1)
            ; /* fatal error */
    }

    adjust_timing();

}

#define PCLK_FREQUENCY          (PROCESSOR_OSCILLATOR_FREQUENCY/2)
#define BAUD_DIVIDER(b)         ((PCLK_FREQUENCY/1)/((b)*16))
#define SERIAL_PORTS_DEFAULT_BAUD       115200

void LPC1788_BSP_UartInit(void)
{
    TUInt32 divider ;
    LPC_UART_TypeDef * p_uart = LPC_UART0;

    // Ensure power is on to the part
    //LPC1788PowerOn(1UL << p->iInfo->iPowerBitIndex);

    divider = BAUD_DIVIDER(SERIAL_PORTS_DEFAULT_BAUD);

    // Set the FIFO enable bit in the FCR register. This bit must be set for
    // proper UART operation.
    p_uart->FCR = 7; // FCRFE|RFR|TFR

    // Set baudrate
    p_uart->LCR |= 0x80;
    p_uart->DLL = divider & 0x00ff;
    p_uart->DLM = (divider >> 8) & 0x00ff;
    p_uart->LCR &= ~0x80;

    // Set default mode (8 bits, 1 stop bit, no parity)
    p_uart->LCR = 0x03;

    //Enable UART0 interrupts
    //p_info->iUART->reg04.IER = 0x03; // Interrupts and TX and RX

    //TBD: For now, leave serial port deactivated
    //    InterruptEnable(p_info->iInterruptChannel);
    //return UEZ_ERROR_NONE;

}

#if DEBUG
size_t __write(int Handle, const unsigned char * Buf, size_t Bufsize)
{
    size_t nChars = 0;
    LPC_UART_TypeDef * p_uart = LPC_UART0;

    for (/*Empty */; Bufsize > 0; --Bufsize)
    {
        while(( p_uart->LSR & (1<<5))==0); //Wait on THRE bit
        p_uart->THR = * Buf++;
        ++nChars;
    }
    return nChars;
}
#endif

/*-------------------------------------------------------------------------*
 * End of File:  LPC1788_BSP.c
 *-------------------------------------------------------------------------*/
